In [1]:
import random
import pandas as pd

In [3]:
items = []
number = random.randint(0, 10000)
for x in range(0 , number) :
    dollars = random.randint(200_000, 50_000_000)
    data = {
        "Player Name" : f"Player={x}",
        "Player Salary": f"${dollars:,.2f}"
    }

    items.append(data)

In [4]:
df = pd.DataFrame(items)

In [5]:
df.head()

  Player Name   Player Salary
0    Player=0  $25,426,895.00
1    Player=1  $22,621,989.00
2    Player=2  $10,124,927.00
3    Player=3  $30,213,136.00
4    Player=4   $4,090,828.00

In [6]:
df.to_csv("example.csv", index=False)

In [9]:
df2 = pd.read_csv("example.csv")

In [10]:
df2

    Player Name   Player Salary
0      Player=0  $25,426,895.00
1      Player=1  $22,621,989.00
2      Player=2  $10,124,927.00
3      Player=3  $30,213,136.00
4      Player=4   $4,090,828.00
..          ...             ...
954  Player=954  $48,932,978.00
955  Player=955  $48,020,966.00
956  Player=956  $32,576,512.00
957  Player=957   $3,594,233.00
958  Player=958  $26,128,572.00

[959 rows x 2 columns]